# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Kenne\Downloads\BodyAnalyzer-main(3)\BodyAnalyzer-main\esw_uCOS3_cykit.cydsn\esw_uCOS3_cykit.cyprj
# Date: Sun, 10 Nov 2024 23:54:51 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Zeit} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4001 8001} -nominal_period 166666.66666666666 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Zeit_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 480001 960001} [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Kenne\Downloads\BodyAnalyzer-main(3)\BodyAnalyzer-main\esw_uCOS3_cykit.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Kenne\Downloads\BodyAnalyzer-main(3)\BodyAnalyzer-main\esw_uCOS3_cykit.cydsn\esw_uCOS3_cykit.cyprj
# Date: Sun, 10 Nov 2024 23:54:46 GMT
